import pandas as pd

data = pd.read_excel('./data/BU Data from Survey Cases_final.xlsx', skiprows=1)

rename_map = {
    'เพศ': 'sex',
    'อายุ': 'age',
    'โปรดระบุอาชีพของคุณ (อื่นๆ โปรดระบุ)': 'occupation',
    'โปรดเลือกรายได้ต่อเดือนของคุณ': 'monthly_income',
    'โปรดพิมพ์จังหวัดที่อยู่อาศัยของคุณ เช่น กทม. , ขอนแก่น, ชลบุรี': 'province',
    'โปรดเลือกประเภทผิวของคุณ': 'skin_type',
    'คุณมีความกังวล/ปัญหาผิวในเรื่องใดบ้าง (เลือกได้หลายข้อ)': 'concerns',
    'คุณเป็นสิวหรือไม่ เป็นสิวรุนแรงระดับใด': 'acne_level',
    "คุณปรึกษาหรือได้รับอิทธิพลจากใครในการเลือกสกินแคร์ 'สำหรับผิวหน้า' บ้าง (เลือกได้หลายคำตอบ)": 'consult_influencer',
    "คุณเลือกสกินแคร์ 'สำหรับผิวหน้า' อย่างไร (เลือกได้หลายข้อ)": 'skincare_face_method',
    'คุณเลือกคลีนซิ่ง เช่น Cleansing water, cleansing balm, cleansing oil อย่างไร (เลือกได้หลายข้อ)': 'cleansing_method',
    'คุณใช้คลีนซิ่งแบบน้ำ (Cleansing water) หรือไม่': 'use_cleansing_water',
    'ปัจจุบันคุณใช้คลีนซิ่งแบบใดบ้าง (หากใช้หลายแบบ เลือกได้หลายคำตอบ)': 'cleansing_types_used',
    'คุณใช้คลีนซิ่งแบบใดมากที่สุด (เลือกคำตอบเดียว)': 'cleansing_type_most_used',
    'คุณใช้คลีนซิ่ง (Cleansing water) สูตรใด (หากใช้หลายแบบ เลือกได้หลายคำตอบ)': 'cleansing_water_formula',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [เช็ดเมคอัพสะอาดหมดจด (Deep cleansing)]': 'factor_deep_cleansing',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [ช่วยลดสิว/ไม่ก่อให้เกิดสิวใหม่ (Acne-prone skin friendly)]': 'factor_acne_friendly',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [อ่อนโยนต่อผิวแพ้ง่าย (Sensitive skin friendly)]': 'factor_sensitive_friendly',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [ผ่านการทดสอบทางการแพทย์ (Hypoallergenic)]': 'factor_hypoallergenic',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [เช็ดแล้วชุ่มชื้น ผิวไม่แห้งตึง (Skin moisturized)]': 'factor_moisturizing',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [ลดแรงเสียดสีของสำลีกับใบหน้า เช็ดแล้วไม่แสบผิว (Low friction formula)]': 'factor_low_friction',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [มีสารบำรุงในตัว (Skin nourishment)]': 'factor_nourishment',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [เช็ดรอบดวงตาได้ไม่แสบตา (Eye-friendly)]': 'factor_eye_friendly',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [ช่วยลด/ควบคุมความมัน (Oil control)]': 'factor_oil_control',
    'ในการพิจารณาซื้อคลีนซิ่ง คุณพิจารณาคุณสมบัติใดบ้าง (5=มีผลต่อการพิจารณามากที่สุด) [ไม่มีสารก่อการแพ้ (เช่น ไม่มีแอลกอฮอล์, ไม่มีน้ำหอม, ไม่มีสี)]': 'factor_no_allergen',
    'ปัจจัยใดบ้างที่ส่งผลต่อการเปลี่ยนหรือทดลองคลีนซิ่งใหม่ (อื่นๆ โปรดพิมพ์ระบุเหตุผลสั้นๆ)': 'switch_factors',
    'ปัจจุบันคุณใช้คลีนซิ่งแบรนด์ใดอยู่บ้าง (เลือกได้หลายคำตอบ, เลือกอื่นๆ โปรดระบุ)': 'brands_used',
    'ปัจจุบันคุณใช้คลีนซิ่งแบรนด์ใดบ่อยที่สุด (เลือกเพียงคำตอบเดียว)': 'brand_primary',
}
data.rename(columns=rename_map, inplace=True)



data = data.drop(['Timestamp'], axis=1)

print(data.columns)

data.to_csv("./data/cleansing_water_data.csv", index=False)